Tekla.Structures.DialogInternal.ProfileAttributeRequestArgs
Argument for attribute request event

Tekla.Structures.DialogInternal.ProfileAttributeRequestArgs.Attributes
Gets the profile attributes

Tekla.Structures.DialogInternal.ProfileAttributeRequestArgs.#ctor(Tekla.Structures.DialogInternal.ProfileAttributes)
Construct AttributeRequestArgs
attributes: Profile attributes